validation/conventional/hysingBenchmark/RANS/3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters	1;

cells			100;

xmin			0;
ymin			0;
zmin			0;

x				1.0;

y				2.0;

z				1.0;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xCells		#calc "round($cells * $x)";

yCells		#calc "round($cells * $y)";

zCells		#calc "round($cells * $z)";


vertices
(
	//BLOCK1
	(#calc "$xmin - 0.5 * $x"			$ymin					#calc "$zmin - 0.5 * $z")				//0
    (#calc "$xmin + 0.5 * $x"			$ymin					#calc "$zmin - 0.5 * $z")				//1
    (#calc "$xmin + 0.5 * $x"			#calc "$ymin + $y"		#calc "$zmin - 0.5 * $z")				//2
    (#calc "$xmin - 0.5 * $x"			#calc "$ymin + $y"		#calc "$zmin - 0.5 * $z")				//3
    (#calc "$xmin - 0.5 * $x"			$ymin					#calc "$zmin + 0.5 * $z")				//4
    (#calc "$xmin + 0.5 * $x"			$ymin					#calc "$zmin + 0.5 * $z")				//5
    (#calc "$xmin + 0.5 * $x"			#calc "$ymin + $y"		#calc "$zmin + 0.5 * $z")				//6
    (#calc "$xmin - 0.5 * $x"			#calc "$ymin + $y"		#calc "$zmin + 0.5 * $z")				//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)	($xCells $yCells $zCells)	simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
			(0 4 7 3)
			(2 6 5 1)
			(4 5 6 7)
			(0 3 2 1)
        );
    }

    bottom
    {
        type wall;
        faces
        (
			(1 5 4 0)
        );
    }

    top
    {
        type wall;
        faces
        (
			(3 7 6 2)
        );
    }


    internal
    {
        type internal;
        faces ();
    }
);

// ************************************************************************* //
